app/views/index/home.html.erb

<div class="row">
<% Gossip.all.each_with_index do |gossip,i| %>
---
SELECT "gossips".* FROM "gossips"