app/controllers/application_controller.rb

def current_users
   @current_users ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]