app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @gossip = Gossip.all.find_by(id:params[:id])
    @gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lolilol 360 no scope"], ["content", "Ouais lolilol 360 no scope, et alors ?"], ["user_id", 1], ["created_at", "2021-11-04 18:50:43.511111"], ["updated_at", "2021-11-04 18:50:43.511111"]]
---
    def create


      @gossip = Gossip.new(title:params[:title], content:params[:content], user:current_users)
      if @gossip.save